class location {
  double longitde;
  double latitude;
  location(this.latitude, this.longitde);
}

var governemetsLatAndLongMap = {
  'مصر الجديدة': location(30.090984, 31.322709),
  'مدينة نصر': location(30.054431, 31.344478),
  'المعادي': location(29.962696, 31.276942),
  'التجمع': location(30.004722, 31.434167),
  'حدائق القبة': location(30.085791, 31.278373),
  'مدينة العبور': location(30.205, 31.4575),
  'المنيل': location(30.021361, 31.226865),
  'شبرا': location(30.100239, 31.250574),
  'وسط البلد': location(30.04631, 31.247556),
  'مدينة السلام': location(30.173549, 31.407642),
  'الرحاب': location(30.066271, 31.485601),
  'الزمالك': location(30.056925, 31.221822),
  'الزيتون': location(30.119387, 31.318419),
  'السيدة زينب': location(30.028926, 31.242606),
  'الشروق': location(30.143000, 31.630217),
  'العاشر من رمضان': location(30.318660, 31.752880),
  'العباسية': location(30.065479, 31.272351),
  'القطامية': location(29.9649014, 31.479376),
  'المرج': location(30.1542907, 31.3484448),
  'المطرية': location(30.1190556, 31.3098388999999),
  'المقطم': location(30.021667, 31.303333),
  'بولاق': location(30.0631325, 31.2311579),
  'حدائق المعادي': location(29.9727328, 31.250002),
  'المقطم': location(30.021667, 31.303333),
  'المقطم': location(30.021667, 31.303333),
  'المقطم': location(30.021667, 31.303333),
  'المقطم': location(30.021667, 31.303333),
  'المقطم': location(30.021667, 31.303333),
  'المقطم': location(30.021667, 31.303333),
};
